# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNeXt_Stem, [96, 4, 4]]  # 0-P2/4
  - [-1, 3, ConvNeXt_Block, [96]]
  - [-1, 1, ConvNeXt_Downsample, [192, 2, 2]] # 2-P3/8
  - [-1, 3, ConvNeXt_Block, [192]]
  - [-1, 1, ConvNeXt_Downsample, [384, 2, 2]] # 4-P4/16
  - [-1, 27, ConvNeXt_Block, [384]]
  - [-1, 1, ConvNeXt_Downsample, [768, 2, 2]] # 6-P5/32
  - [-1, 3, ConvNeXt_Block, [768]]

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [384]]  # 10

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [192]]  # 13 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] #  p3
  - [[-1, 10], 1, Concat, [1]]  # cat head P3
  - [-1, 3, C2f, [384]]  # 16 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # p4
  - [[-1, 7], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [768]]  # 19 (P5/32-large)

  - [[13, 16, 19], 1, Detect, [nc]]  # Detect(P3, P4, P5)